mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
static uint32_t curFrameBufferAddress;
static uint32_t setFrameBufferAddress[2];
static uint32_t showFrameBufferAddress[2];
static uint8_t showAlpha[2];

#define maxChars 0x60
//{{{  struct tFontChar
typedef struct {
  uint8_t* bitmap;
  int16_t left;
  int16_t top;
  int16_t pitch;
  int16_t rows;
  int16_t advance;
  } tFontChar;
//}}}
static tFontChar* chars[maxChars];

static FT_Library FTlibrary;
static FT_Face FTface;
static FT_GlyphSlot FTglyphSlot;
//}}}

LTDC_HandleTypeDef hLtdc;
//{{{
void LCD_LTDC_IRQHandler() {

  if (LTDC->ISR & LTDC_IT_FU) ltdc.fifoUnderunIrq++;
  if (LTDC->ISR & LTDC_IT_TE) ltdc.transferErrorIrq++;

  // line interrupt
  if (LTDC->ISR & LTDC_IT_LI) {
    // switch showFrameBuffer
    LTDC_Layer_TypeDef* ltdcLayer = (LTDC_Layer_TypeDef*)((uint32_t)LTDC + 0x84); // + (0x80*layer));
    ltdcLayer->CFBAR = showFrameBufferAddress[0];
    if (showAlpha[0]) {
      ltdcLayer->CR |= LTDC_LxCR_LEN;
      ltdcLayer->CACR &= ~LTDC_LxCACR_CONSTA;
      ltdcLayer->CACR = showAlpha[0];
      }
    else
      ltdcLayer->CR &= ~LTDC_LxCR_LEN;
    LTDC->SRCR |= LTDC_SRCR_IMR;

    ltdc.lineTicks = osKernelSysTick() - ltdc.lastTicks;
    ltdc.lastTicks = osKernelSysTick();
    ltdc.lineIrq++;

    if (ltdc.frameWait)
      osSemaphoreRelease (ltdc.sem);
    ltdc.frameWait = 0;
    }

  LTDC->ICR = LTDC_FLAG_LI | LTDC_FLAG_FU | LTDC_FLAG_TE;
  }
//}}}
//{{{
void LCD_DMA2D_IRQHandler() {

  // clear interrupt flags
  DMA2D->IFCR = DMA2D_ISR_TCIF | DMA2D_ISR_TEIF | DMA2D_ISR_CEIF;

  while (true) {
    switch (*mDma2dIsrBuf++) {
      case kWipe:
        DMA2D->OCOLR = *mDma2dIsrBuf++;  // colour
        DMA2D->OMAR  = *mDma2dIsrBuf++;  // fb start address
        DMA2D->OOR   = *mDma2dIsrBuf++;  // stride
        DMA2D->NLR   = *mDma2dIsrBuf++;  // width:height
        DMA2D->CR = DMA2D_R2M | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
        return;

      case kStamp:
        DMA2D->FGCOLR = *mDma2dIsrBuf++; // src color
        DMA2D->OMAR   = *mDma2dIsrBuf;   // bgnd fb start address
        DMA2D->BGMAR  = *mDma2dIsrBuf++;
        DMA2D->OOR    = *mDma2dIsrBuf;   // bgnd stride
        DMA2D->BGOR   = *mDma2dIsrBuf++;
        DMA2D->NLR    = *mDma2dIsrBuf++; // width:height
        DMA2D->FGMAR  = *mDma2dIsrBuf++; // src start address
        DMA2D->CR = DMA2D_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
        return;

      default: // normally 0
        // no more opCodes, disable interrupts and release semaphore to signal done
        DMA2D->CR = 0;
        mDma2dIsrBuf = mDma2dBuf;
        osSemaphoreRelease (mDma2dSem);
        return;
      }
    }
  }
//}}}

cLcd* cLcd::mLcd = nullptr;

#ifdef STM32F769I_DISCO
//{{{
static void dsiWriteCmd (uint32_t NbrParams, uint8_t* pParams) {

  if (NbrParams <= 1)
   HAL_DSI_ShortWrite (&hdsi_discovery, 0, DSI_DCS_SHORT_PKT_WRITE_P1, pParams[0], pParams[1]);
  else
   HAL_DSI_LongWrite (&hdsi_discovery,  0, DSI_DCS_LONG_PKT_WRITE, NbrParams, pParams[NbrParams], pParams);
  }
//}}}
//{{{
static void otm8009aInit (bool landscape) {

  /* Enable CMD2 to access vendor specific commands                               */
  /* Enter in command 2 mode and set EXTC to enable address shift function (0x00) */
  dsiWriteCmd (0, (uint8_t*)ShortRegData1);
  dsiWriteCmd (3, (uint8_t*)lcdRegData1);

  /* Enter ORISE Command 2 */
  dsiWriteCmd (0, (uint8_t*)ShortRegData2); /* Shift address to 0x80 */
  dsiWriteCmd (2, (uint8_t*)lcdRegData2);

  /* SD_PCH_CTRL - 0xC480h - 129th parameter - Default 0x00          */
  /* Set SD_PT                                                       */
  /* -> Source output level during porch and non-display area to GND */
  dsiWriteCmd (0, (uint8_t*)ShortRegData2);
  dsiWriteCmd (0, (uint8_t*)ShortRegData3);
  HAL_Delay(10);

  /* Not documented */
  dsiWriteCmd (0, (uint8_t*)ShortRegData4);
  dsiWriteCmd (0, (uint8_t*)ShortRegData5);
  HAL_Delay(10);

  /* PWR_CTRL4 - 0xC4B0h - 178th parameter - Default 0xA8 */
  /* Set gvdd_en_test                                     */
  /* -> enable GVDD test mode !!!                         */
  dsiWriteCmd (0, (uint8_t*)ShortRegData6);
  dsiWriteCmd (0, (uint8_t*)ShortRegData7);

  /* PWR_CTRL2 - 0xC590h - 146th parameter - Default 0x79      */
  /* Set pump 4 vgh voltage                                    */
  /* -> from 15.0v down to 13.0v                               */
  /* Set pump 5 vgh voltage                                    */
  /* -> from -12.0v downto -9.0v                               */
  dsiWriteCmd (0, (uint8_t*)ShortRegData8);
  dsiWriteCmd (0, (uint8_t*)ShortRegData9);

  /* P_DRV_M - 0xC0B4h - 181th parameter - Default 0x00 */
  /* -> Column inversion                                */
  dsiWriteCmd (0, (uint8_t*)ShortRegData10);
  dsiWriteCmd (0, (uint8_t*)ShortRegData11);

  /* VCOMDC - 0xD900h - 1st parameter - Default 0x39h */
  /* VCOM Voltage settings                            */
  /* -> from -1.0000v downto -1.2625v                 */
  dsiWriteCmd (0, (uint8_t*)ShortRegData1);
  dsiWriteCmd (0, (uint8_t*)ShortRegData12);

  /* Oscillator adjustment for Idle/Normal mode (LPDT only) set to 65Hz (default is 60Hz) */
  dsiWriteCmd (0, (uint8_t*)ShortRegData13);
  dsiWriteCmd (0, (uint8_t*)ShortRegData14);

  /* Video mode internal */
  dsiWriteCmd (0, (uint8_t*)ShortRegData15);
  dsiWriteCmd (0, (uint8_t*)ShortRegData16);

  /* PWR_CTRL2 - 0xC590h - 147h parameter - Default 0x00 */
  /* Set pump 4&5 x6                                     */
  /* -> ONLY VALID when PUMP4_EN_ASDM_HV = "0"           */
  dsiWriteCmd (0, (uint8_t*)ShortRegData17);
  dsiWriteCmd (0, (uint8_t*)ShortRegData18);

  /* PWR_CTRL2 - 0xC590h - 150th parameter - Default 0x33h */
  /* Change pump4 clock ratio                              */
  /* -> from 1 line to 1/2 line                            */
  dsiWriteCmd (0, (uint8_t*)ShortRegData19);
  dsiWriteCmd (0, (uint8_t*)ShortRegData9);

  /* GVDD/NGVDD settings */
  dsiWriteCmd (0, (uint8_t*)ShortRegData1);
  dsiWriteCmd (2, (uint8_t*)lcdRegData5);

  /* PWR_CTRL2 - 0xC590h - 149th parameter - Default 0x33h */
  /* Rewrite the default value !                           */
  dsiWriteCmd (0, (uint8_t*)ShortRegData20);
  dsiWriteCmd (0, (uint8_t*)ShortRegData21);

  /* Panel display timing Setting 3 */
  dsiWriteCmd(0, (uint8_t*)ShortRegData22);
  dsiWriteCmd (0, (uint8_t*)ShortRegData23);

  /* Power control 1 */
  dsiWriteCmd (0, (uint8_t*)ShortRegData24);
  dsiWriteCmd (0, (uint8_t*)ShortRegData25);

  /* Source driver precharge */
  dsiWriteCmd (0, (uint8_t *)ShortRegData13);
  dsiWriteCmd (0, (uint8_t*)ShortRegData26);

  dsiWriteCmd (0, (uint8_t*)ShortRegData15);
  dsiWriteCmd (0, (uint8_t*)ShortRegData27);

