mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
  dsiWriteCmd (0, (uint8_t*)ShortRegData28);
  dsiWriteCmd (2, (uint8_t *)lcdRegData6);

  /* GOAVSt*/
  dsiWriteCmd (0, (uint8_t*)ShortRegData2);
  dsiWriteCmd (6, (uint8_t*)lcdRegData7);

  dsiWriteCmd (0, (uint8_t*)ShortRegData29);
  dsiWriteCmd (14, (uint8_t*)lcdRegData8);

  dsiWriteCmd (0, (uint8_t*)ShortRegData30);
  dsiWriteCmd (14, (uint8_t*)lcdRegData9);

  dsiWriteCmd (0, (uint8_t*)ShortRegData31);
  dsiWriteCmd (10, (uint8_t*)lcdRegData10);

  dsiWriteCmd (0, (uint8_t*)ShortRegData32);
  dsiWriteCmd (0, (uint8_t*)ShortRegData46);

  dsiWriteCmd (0, (uint8_t*)ShortRegData2);
  dsiWriteCmd (10, (uint8_t*)lcdRegData11);

  dsiWriteCmd (0, (uint8_t*)ShortRegData33);
  dsiWriteCmd (15, (uint8_t*)lcdRegData12);

  dsiWriteCmd (0, (uint8_t*)ShortRegData29);
  dsiWriteCmd (15, (uint8_t*)lcdRegData13);

  dsiWriteCmd (0, (uint8_t*)ShortRegData30);
  dsiWriteCmd (10, (uint8_t*)lcdRegData14);

  dsiWriteCmd (0, (uint8_t*)ShortRegData31);
  dsiWriteCmd (15, (uint8_t*)lcdRegData15);

  dsiWriteCmd (0, (uint8_t*)ShortRegData32);
  dsiWriteCmd (15, (uint8_t*)lcdRegData16);

  dsiWriteCmd (0, (uint8_t*)ShortRegData34);
  dsiWriteCmd (10, (uint8_t*)lcdRegData17);

  dsiWriteCmd (0, (uint8_t*)ShortRegData35);
  dsiWriteCmd (10, (uint8_t*)lcdRegData18);

  dsiWriteCmd (0, (uint8_t*)ShortRegData2);
  dsiWriteCmd (10, (uint8_t*)lcdRegData19);

  dsiWriteCmd (0, (uint8_t*)ShortRegData33);
  dsiWriteCmd (15, (uint8_t*)lcdRegData20);

  dsiWriteCmd (0, (uint8_t*)ShortRegData29);
  dsiWriteCmd (15, (uint8_t*)lcdRegData21);

  dsiWriteCmd (0, (uint8_t*)ShortRegData30);
  dsiWriteCmd (10, (uint8_t*)lcdRegData22);

  dsiWriteCmd (0, (uint8_t*)ShortRegData31);
  dsiWriteCmd (15, (uint8_t*)lcdRegData23);

  dsiWriteCmd (0, (uint8_t*)ShortRegData32);
  dsiWriteCmd (15, (uint8_t*)lcdRegData24);

  /* PWR_CTRL1 - 0xc580h - 130th parameter - default 0x00 */
  /* Pump 1 min and max DM                                */
  dsiWriteCmd (0, (uint8_t*)ShortRegData13);
  dsiWriteCmd (0, (uint8_t*)ShortRegData47);
  dsiWriteCmd (0, (uint8_t*)ShortRegData48);
  dsiWriteCmd (0, (uint8_t*)ShortRegData49);

  /* Exit CMD2 mode */
  dsiWriteCmd (0, (uint8_t*)ShortRegData1);
  dsiWriteCmd (3, (uint8_t*)lcdRegData25);

  // Standard DCS Initialization TO KEEP CAN BE DONE IN HSDT                   */

  /* NOP - goes back to DCS std command ? */
  dsiWriteCmd (0, (uint8_t*)ShortRegData1);

  /* Gamma correction 2.2+ table (HSDT possible) */
  dsiWriteCmd (0, (uint8_t*)ShortRegData1);
  dsiWriteCmd (16, (uint8_t*)lcdRegData3);

  /* Gamma correction 2.2- table (HSDT possible) */
  dsiWriteCmd (0, (uint8_t*)ShortRegData1);
  dsiWriteCmd (16, (uint8_t*)lcdRegData4);

  /* Send Sleep Out command to display : no parameter */
  dsiWriteCmd (0, (uint8_t*)ShortRegData36);

  /* Wait for sleep out exit*/
  HAL_Delay (120);

  //dsiWriteCmd (0, (uint8_t*)ShortRegData37); // Set Pixel color format to RGB565
  dsiWriteCmd (0, (uint8_t*)ShortRegData38); // Set Pixel color format to RGB888

  // portrait by default
  if (landscape) {
    dsiWriteCmd (0, (uint8_t*)ShortRegData39);
    dsiWriteCmd (4, (uint8_t*)lcdRegData27);
    dsiWriteCmd (4, (uint8_t*)lcdRegData28);
    }

  // CABC : Content Adaptive Backlight Control section start
  dsiWriteCmd (0, (uint8_t*)ShortRegData40); // defaut is 0 (lowest Brightness), 0xFF is highest Brightness, try 0x7F : intermediate value
  dsiWriteCmd (0, (uint8_t*)ShortRegData41); // defaut is 0, try 0x2C - Brightness Control Block, Display Dimming & BackLight on
  dsiWriteCmd (0, (uint8_t*)ShortRegData42); // defaut is 0, try 0x02 - image Content based Adaptive Brightness [Still Picture]
  dsiWriteCmd (0, (uint8_t*)ShortRegData43); // defaut is 0 (lowest Brightness), 0xFF is highest Brightness

  /* Send Command Display On */
  dsiWriteCmd (0, (uint8_t*)ShortRegData44);

  /* NOP command */
  dsiWriteCmd (0, (uint8_t*)ShortRegData1);

  /* Send Command GRAM memory write (no parameters) : this initiates frame write via other DSI commands sent by */
  /* DSI host from LTDC incoming pixels in video mode */
  dsiWriteCmd (0, (uint8_t*)ShortRegData45);
  }
//}}}
#endif

// cLcd
//{{{
cLcd::cLcd (uint32_t buffer0, uint32_t buffer1)  {

  mBuffer[false] = buffer0;
  mBuffer[true] = buffer1;

  updateNumDrawLines();
  }
//}}}
cLcd::~cLcd() {}

// static members
//{{{
cLcd* cLcd::create (std::string title) {

  if (!mLcd) {
    mLcd = new cLcd (SDRAM_FRAME0, SDRAM_FRAME1);
    mLcd->init (title);
    }

  return mLcd;
  }
//}}}
//{{{
std::string cLcd::hex (int value, uint8_t width) {

  std::ostringstream os;
  if (width)
    os << std::hex << std::setfill ('0') << std::setw (width) << value;
  else
    os << std::hex << value;
  return os.str();
  }
//}}}
//{{{
std::string cLcd::dec (int value, uint8_t width, char fill) {

  std::ostringstream os;
  if (width)
    os << std::setfill (fill) << std::setw (width) << value;
  else
    os << value;
  return os.str();
  }
//}}}

// public members
//{{{
void cLcd::setTitle (std::string title) {
  mTitle = title;
  updateNumDrawLines();
  }
//}}}
//{{{
void cLcd::setShowDebug (bool title, bool info, bool lcdStats, bool footer) {

  mShowTitle = title;
  mShowInfo = info;
  mShowLcdStats = lcdStats;
  mShowFooter = footer;

  updateNumDrawLines();
  }
//}}}

//{{{
void cLcd::info (uint32_t colour, std::string str, bool newLine) {

  bool tailing = mLastLine == (int)mFirstLine + mNumDrawLines - 1;

  auto line = (newLine && (mLastLine < mMaxLine-1)) ? mLastLine+1 : mLastLine;
  mLines[line].mTime = osKernelSysTick();
  mLines[line].mColour = colour;
  mLines[line].mString = str;
  if (newLine)
    mLastLine = line;

  if (tailing)
    mFirstLine = mLastLine - mNumDrawLines + 1;
  }
//}}}
//{{{
void cLcd::info (std::string str, bool newLine) {
  info (COL_WHITE, str, newLine);
  }
//}}}

//{{{
void cLcd::press (int pressCount, int x, int y, int z, int xinc, int yinc) {

  if ((pressCount > 30) && (x <= mStringPos) && (y <= getLineHeight()))
    reset();
  else if (pressCount == 0) {
    if (x <= mStringPos) {
      // set displayFirstLine
      if (y < 2 * getLineHeight())
        displayTop();
      else if (y > getHeight() - 2 * getLineHeight())
        displayTail();
      }
    }
  else {
    // inc firstLine
    float value = mFirstLine - ((2.0f * yinc) / getLineHeight());

