mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
    if (value < 0)
      mFirstLine = 0;
    else if (mLastLine <= (int)mNumDrawLines-1)
      mFirstLine = 0;
    else if (value > mLastLine - mNumDrawLines + 1)
      mFirstLine = mLastLine - mNumDrawLines + 1;
    else
      mFirstLine = value;
    }
  }
//}}}

//{{{
void cLcd::startRender() {

  mDrawBuffer = !mDrawBuffer;
  setLayer (0, mBuffer[mDrawBuffer]);

  // frameSync;
  ltdc.frameWait = 1;
  if (osSemaphoreWait (ltdc.sem, 100) != osOK)
    ltdc.timeouts++;

  mDrawStartTime = osKernelSysTick();
  }
//}}}
//{{{
void cLcd::renderCursor (uint32_t colour, int16_t x, int16_t y, int16_t z) {
  ellipse (colour, x, y, z, z);
  }
//}}}
//{{{
void cLcd::endRender (bool forceInfo) {

  auto y = 0;
  if (mShowTitle && !mTitle.empty()) {
    //{{{  draw title
    text (COL_WHITE, getFontHeight(), mTitle, 0, y, getWidth(), getLineHeight());
    y += getLineHeight();
    }
    //}}}
  if (mShowInfo || forceInfo) {
    //{{{  draw info lines
    if (mLastLine >= 0) {
      // draw scroll bar
      auto yorg = getLineHeight() + ((int)mFirstLine * mNumDrawLines * getLineHeight() / (mLastLine + 1));
      auto height = mNumDrawLines * mNumDrawLines * getLineHeight() / (mLastLine + 1);
      rectClipped (COL_YELLOW, 0, yorg, 8, height);
      }

    auto lastLine = (int)mFirstLine + mNumDrawLines - 1;
    if (lastLine > mLastLine)
      lastLine = mLastLine;
    for (auto lineIndex = (int)mFirstLine; lineIndex <= lastLine; lineIndex++) {
      auto x = 0;
      auto xinc = text (COL_GREEN, getFontHeight(),
                        dec ((mLines[lineIndex].mTime-mStartTime) / 1000) + "." +
                        dec ((mLines[lineIndex].mTime-mStartTime) % 1000, 3, '0'), x, y, getWidth(), getLineHeight());
      x += xinc + 3;
      text (mLines[lineIndex].mColour, getFontHeight(), mLines[lineIndex].mString, x, y, getWidth(), getLineHeight());
      y += getLineHeight();
      }
    }
    //}}}
  if (mShowLcdStats) {
    //{{{  draw lcdStats
    std::string str = dec (ltdc.lineIrq) + ":f " +
                  dec (ltdc.lineTicks) + "ms " +
                      dec (mDma2dHighWater-mDma2dBuf) + ":hi " +
                      dec (mDma2dTimeouts) + " " +
                      dec (ltdc.transferErrorIrq) + " " +
                      dec (ltdc.fifoUnderunIrq);
    text (COL_WHITE, getFontHeight(), str, 0, getHeight() - 2 * getLineHeight(), getWidth(), 24);
    }
    //}}}
  if (mShowFooter)
    //{{{  draw footer
    text (COL_YELLOW, getFontHeight(),
          dec (xPortGetFreeHeapSize()) + " " + dec (osGetCPUUsage()) + "% " + dec (mDrawTime) + "ms",
          0, getHeight()-getLineHeight(), getWidth(), getLineHeight());
    //}}}

  sendWait();
  showLayer (0, mBuffer[mDrawBuffer], 255);

  mDrawTime = osKernelSysTick() - mDrawStartTime;
  }
//}}}

//{{{
void cLcd::displayOn() {

  #ifdef STM32F746xx
    // enable LTDC
    LTDC->GCR |= LTDC_GCR_LTDCEN;

    // turn on DISP pin
    HAL_GPIO_WritePin (LCD_DISP_GPIO_PORT, LCD_DISP_PIN, GPIO_PIN_SET);        /* Assert LCD_DISP pin */

    // turn on backlight
    HAL_GPIO_WritePin (LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_SET);  /* Assert LCD_BL_CTRL pin */
  #else
    /* Send Display on DCS command to display */
    HAL_DSI_ShortWrite (&(hdsi_discovery), hdsivideo_handle.VirtualChannelID, DSI_DCS_SHORT_PKT_WRITE_P1,
                        OTM8009A_CMD_DISPON, 0x00);
  #endif
  }
//}}}
//{{{
void cLcd::displayOff() {

   #ifdef STM32F746xx
    // disable LTDC
    LTDC->GCR &= ~LTDC_GCR_LTDCEN;

    // turn off DISP pin
    HAL_GPIO_WritePin (LCD_DISP_GPIO_PORT, LCD_DISP_PIN, GPIO_PIN_RESET);      /* De-assert LCD_DISP pin */

    // turn off backlight
    HAL_GPIO_WritePin (LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_RESET);/* De-assert LCD_BL_CTRL pin */
  #else
    /* Send Display off DCS Command to display */
    HAL_DSI_ShortWrite (&(hdsi_discovery), hdsivideo_handle.VirtualChannelID, DSI_DCS_SHORT_PKT_WRITE_P1,
                        OTM8009A_CMD_DISPOFF, 0x00);
  #endif
  }
//}}}

// iDraw
//{{{
void cLcd::pixel (uint32_t colour, int16_t x, int16_t y) {

  rect (colour, x, y, 1, 1);
  }
//}}}
//{{{
void cLcd::rect (uint32_t colour, int16_t x, int16_t y, uint16_t width, uint16_t height) {

  *mDma2dCurBuf++ = colour;                                             // colour
  *mDma2dCurBuf++ = curFrameBufferAddress + ((y * getWidth()) + x) * 4; // fb start address
  *mDma2dCurBuf++ = getWidth() - width;                                 // stride
  *mDma2dCurBuf++ = (width << 16) | height;                             // width:height
  *mDma2dCurBuf++ = 0;                                                  // terminate
  *(mDma2dCurBuf-6) = kWipe;                                            // fill opCode

  if (mDma2dCurBuf > mDma2dHighWater)
    mDma2dHighWater = mDma2dCurBuf;
  }
//}}}
//{{{
void cLcd::stamp (uint32_t colour, uint8_t* src, int16_t x, int16_t y, uint16_t width, uint16_t height) {

  *mDma2dCurBuf++ = colour;                                             // colour
  *mDma2dCurBuf++ = curFrameBufferAddress + ((y * getWidth()) + x) * 4; // bgnd fb start address
  *mDma2dCurBuf++ = getWidth() - width;                                 // stride
  *mDma2dCurBuf++ = (width << 16) | height;                             // width:height
  *mDma2dCurBuf++ = (uint32_t)src;                                      // src start address
  *mDma2dCurBuf++ = 0;                                                  // terminate
  *(mDma2dCurBuf-7) = kStamp;                                           // stamp opCode

  if (mDma2dCurBuf > mDma2dHighWater)
    mDma2dHighWater = mDma2dCurBuf;
  }
//}}}
//{{{
int cLcd::text (uint32_t colour, int fontHeight, std::string str, int16_t x, int16_t y, uint16_t width, uint16_t height) {

  for (unsigned int i = 0; i < str.size(); i++) {
    if ((str[i] >= 0x20) && (str[i] <= 0x7F)) {
      auto fontChar = chars[str[i] - 0x20];
      if (!fontChar) {
        FT_Set_Pixel_Sizes (FTface, 0, fontHeight);
        FT_Load_Char (FTface, str[i], FT_LOAD_RENDER);

        // cache char info
        fontChar = (tFontChar*)pvPortMalloc (sizeof(tFontChar));
        chars[str[i] - 0x20] = fontChar;
        fontChar->left = FTglyphSlot->bitmap_left;
        fontChar->top = FTglyphSlot->bitmap_top;
        fontChar->pitch = FTglyphSlot->bitmap.pitch;
        fontChar->rows = FTglyphSlot->bitmap.rows;
        fontChar->advance = FTglyphSlot->advance.x / 64;
        fontChar->bitmap = nullptr;

