mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
// private
//{{{
void cLcd::init (std::string title) {

  mDrawBuffer = !mDrawBuffer;
  ltdcInit (mBuffer[mDrawBuffer]);

  //  dma2d init
  // unchanging dma2d regs
  DMA2D->OPFCCR  = DMA2D_INPUT_ARGB8888; // bgnd fb ARGB
  DMA2D->BGPFCCR = DMA2D_INPUT_ARGB8888;
  DMA2D->FGPFCCR = DMA2D_INPUT_A8;       // src alpha
  DMA2D->FGOR    = 0;              // src stride
  //DMA2D->AMTCR = 0x1001;

  // zero out first opcode, point past it
  mDma2dBuf = (uint32_t*)DMA2D_BUFFER; // pvPortMalloc (8192 * 4);
  mDma2dCurBuf = mDma2dBuf;
  *mDma2dCurBuf++ = 0;
  mDma2dHighWater = mDma2dCurBuf;
  mDma2dIsrBuf = mDma2dBuf;
  mDma2dTimeouts = 0;

  // dma2d IRQ init
  osSemaphoreDef (dma2dSem);
  mDma2dSem = osSemaphoreCreate (osSemaphore (dma2dSem), -1);

  HAL_NVIC_SetPriority (DMA2D_IRQn, 0x0F, 0);
  HAL_NVIC_EnableIRQ (DMA2D_IRQn);


  // font init
  setFont (freeSansBold, freeSansBold_len);
  for (auto i = 0; i < maxChars; i++)
    chars[i] = nullptr;

  setTitle (title);
  }
//}}}
//{{{
void cLcd::ltdcInit (uint32_t frameBufferAddress) {

  hLtdc.Instance = LTDC;
  //{{{  common clock enables
  __HAL_RCC_LTDC_CLK_ENABLE();
  __HAL_RCC_DMA2D_CLK_ENABLE();
  //}}}

  #ifdef STM32F746G_DISCO
    //{{{  gpio clock enables
    // enable GPIO clock, includes backlight, display enable
    __HAL_RCC_GPIOE_CLK_ENABLE();
    __HAL_RCC_GPIOG_CLK_ENABLE();
    __HAL_RCC_GPIOI_CLK_ENABLE();
    __HAL_RCC_GPIOJ_CLK_ENABLE();
    __HAL_RCC_GPIOK_CLK_ENABLE();
    //}}}
    //{{{  pll config
    // - PLLSAI_VCO In  = HSE_VALUE / PLLM                        = 1 Mhz
    // - PLLSAI_VCO Out = PLLSAI_VCO Input * PLLSAIN              = 192 Mhz
    // - PLLLCDCLK      = PLLSAI_VCO Output / PLLSAIR    = 192/5  = 38.4 Mhz
    // - LTDC clock     = PLLLCDCLK / LTDC_PLLSAI_DIVR_4 = 38.4/4 = 9.6Mhz

    RCC_PeriphCLKInitTypeDef periph_clk_init_struct;
    periph_clk_init_struct.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
    periph_clk_init_struct.PLLSAI.PLLSAIN = 192;
    periph_clk_init_struct.PLLSAI.PLLSAIR = 5; // could be 7
    periph_clk_init_struct.PLLSAIDivR = RCC_PLLSAIDIVR_4;
    HAL_RCCEx_PeriphCLKConfig (&periph_clk_init_struct);
    //}}}
    //{{{  LTDC pin config
    // GPIOE config
    GPIO_InitTypeDef gpio_init_structure;
    gpio_init_structure.Pin       = GPIO_PIN_4;
    gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
    gpio_init_structure.Pull      = GPIO_NOPULL;
    gpio_init_structure.Speed     = GPIO_SPEED_FAST;
    gpio_init_structure.Alternate = GPIO_AF14_LTDC;
    HAL_GPIO_Init (GPIOE, &gpio_init_structure);

    // GPIOG config
    gpio_init_structure.Pin       = GPIO_PIN_12;
    gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
    gpio_init_structure.Alternate = GPIO_AF9_LTDC;
    HAL_GPIO_Init (GPIOG, &gpio_init_structure);

    // GPIOI LTDC alternate config
    gpio_init_structure.Pin       = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
    gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
    gpio_init_structure.Alternate = GPIO_AF14_LTDC;
    HAL_GPIO_Init (GPIOI, &gpio_init_structure);

    // GPIOJ config
    gpio_init_structure.Pin       = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3 |
                                    GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 |
                                    GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
    gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
    gpio_init_structure.Alternate = GPIO_AF14_LTDC;
    HAL_GPIO_Init (GPIOJ, &gpio_init_structure);

    // GPIOK config
    gpio_init_structure.Pin       = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7;
    gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
    gpio_init_structure.Alternate = GPIO_AF14_LTDC;
    HAL_GPIO_Init (GPIOK, &gpio_init_structure);

    // LCD_DISP GPIO config
    gpio_init_structure.Pin       = LCD_DISP_PIN;
    gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
    HAL_GPIO_Init (LCD_DISP_GPIO_PORT, &gpio_init_structure);

    // LCD_BL_CTRL GPIO config
    gpio_init_structure.Pin       = LCD_BL_CTRL_PIN;
    gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
    HAL_GPIO_Init (LCD_BL_CTRL_GPIO_PORT, &gpio_init_structure);
    //}}}
    //{{{  LTDC info
    #define RK043FN48H_WIDTH   480 // LCD PIXEL WIDTH
    #define RK043FN48H_HSYNC   41  // Horizontal synchronization
    #define RK043FN48H_HBP     13  // Horizontal back porch
    #define RK043FN48H_HFP     32  // Horizontal front porch

    #define RK043FN48H_HEIGHT  272 // LCD PIXEL HEIGHT
    #define RK043FN48H_VSYNC   10  // Vertical synchronization
    #define RK043FN48H_VBP     2   // Vertical back porch
    #define RK043FN48H_VFP     2   // Vertical front porch

    hLtdc.Init.HorizontalSync =     RK043FN48H_HSYNC - 1;
    hLtdc.Init.AccumulatedHBP =     RK043FN48H_HSYNC + RK043FN48H_HBP - 1;
    hLtdc.Init.AccumulatedActiveW = RK043FN48H_WIDTH + RK043FN48H_HSYNC + RK043FN48H_HBP - 1;
    hLtdc.Init.TotalWidth =         RK043FN48H_WIDTH + RK043FN48H_HSYNC + RK043FN48H_HBP + RK043FN48H_HFP - 1;

    hLtdc.Init.VerticalSync =       RK043FN48H_VSYNC - 1;
    hLtdc.Init.AccumulatedVBP =     RK043FN48H_VSYNC + RK043FN48H_VBP - 1;
    hLtdc.Init.AccumulatedActiveH = RK043FN48H_HEIGHT + RK043FN48H_VSYNC + RK043FN48H_VBP - 1;
    hLtdc.Init.TotalHeigh =         RK043FN48H_HEIGHT + RK043FN48H_VSYNC + RK043FN48H_VBP + RK043FN48H_VFP - 1;

    // LTDC Polarity
    hLtdc.Init.HSPolarity = LTDC_HSPOLARITY_AL;
    hLtdc.Init.VSPolarity = LTDC_VSPOLARITY_AL;
    hLtdc.Init.DEPolarity = LTDC_DEPOLARITY_AL;
    hLtdc.Init.PCPolarity = LTDC_PCPOLARITY_IPC;

    // LTDC width height
    hLtdc.LayerCfg->ImageWidth = RK043FN48H_WIDTH;
    hLtdc.LayerCfg->ImageHeight = RK043FN48H_HEIGHT;

    // LTDC Background value
    hLtdc.Init.Backcolor.Blue = 0;
    hLtdc.Init.Backcolor.Green = 0;
    hLtdc.Init.Backcolor.Red = 0;
    //}}}
    HAL_LTDC_Init (&hLtdc);
  #else
    hdsi_discovery.Instance = DSI;
    //{{{  dsi, XRES gpio clock enables
    __HAL_RCC_DSI_CLK_ENABLE();
    __HAL_RCC_GPIOJ_CLK_ENABLE();
    //}}}
    //{{{  pll config
    // Note: The following values should not be changed as the PLLSAI is also used to clock the USB FS
    // PLLSAI_VCO Input = HSE_VALUE/PLL_M = 1 Mhz
    // PLLSAI_VCO Output = PLLSAI_VCO Input * PLLSAIN = 384 Mhz
    // PLLLCDCLK = PLLSAI_VCO Output/PLLSAIR = 384 MHz / 7 = 54.85 MHz
    // LTDC clock frequency = PLLLCDCLK / LTDC_PLLSAI_DIVR_2 = 54.85 MHz / 2 = 27.429 MHz

    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;
    PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
    PeriphClkInitStruct.PLLSAI.PLLSAIN = 384;
    PeriphClkInitStruct.PLLSAI.PLLSAIR = 7;
    PeriphClkInitStruct.PLLSAIDivR = RCC_PLLSAIDIVR_2;
    HAL_RCCEx_PeriphCLKConfig (&PeriphClkInitStruct);
    //}}}
    //{{{  pulse DSI LCD XRES - active low
    // Configure the GPIO on PJ15
    GPIO_InitTypeDef gpio_init_structure;
    gpio_init_structure.Pin   = GPIO_PIN_15;
    gpio_init_structure.Mode  = GPIO_MODE_OUTPUT_PP;
    gpio_init_structure.Pull  = GPIO_PULLUP;
    gpio_init_structure.Speed = GPIO_SPEED_HIGH;
    HAL_GPIO_Init (GPIOJ, &gpio_init_structure);

    // pulse XRES active low
    HAL_GPIO_WritePin (GPIOJ, GPIO_PIN_15, GPIO_PIN_RESET);
    HAL_Delay(20);
    HAL_GPIO_WritePin (GPIOJ, GPIO_PIN_15, GPIO_PIN_SET);
    HAL_Delay(10);
    //}}}
    //{{{  init DSI
    DSI_PLLInitTypeDef dsiPllInit;
    dsiPllInit.PLLNDIV = 100;
    dsiPllInit.PLLIDF = DSI_PLL_IN_DIV5;
    dsiPllInit.PLLODF = DSI_PLL_OUT_DIV1;

    uint32_t laneByteClk_kHz = 62500; /* 500 MHz / 8 = 62.5 MHz = 62500 kHz */
    hdsi_discovery.Init.NumberOfLanes = DSI_TWO_DATA_LANES;
    hdsi_discovery.Init.TXEscapeCkdiv = laneByteClk_kHz / 15620; // TXEscapeCkdiv = f(LaneByteClk)/15.62 = 4
    HAL_DSI_Init (&hdsi_discovery, &dsiPllInit);

    // config DSI
    uint32_t HACT = getWidth(); /*!< Horizontal Active time in units of lcdClk = imageSize X in pixels to display */
    uint32_t VACT = getHeight(); /*!< Vertical Active time in units of lines = imageSize Y in pixels to display */

